tap "chef/chef"
tap "derailed/k9s"
tap "fairwindsops/tap"
tap "hashicorp/tap"
tap "mbode/tap"
tap "mike-engel/jwt-cli"
tap "minamijoyo/hcledit"
tap "wallix/awless"
# Search tool like grep, but optimized for programmers
brew "ack"
# Shell extension to jump to frequently used directories
brew "autojump"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Command-line tool to manage cert-manager
brew "cmctl"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Power of curl, ease of use of httpie
brew "curlie"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Lock file during command
brew "flock"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# Like cURL, but for gRPC
brew "grpcurl"
# Kubernetes package manager
brew "helm"
# HTTP load generator, ApacheBench (ab) replacement
brew "hey"
# Improved top (interactive process viewer)
brew "htop"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Interactive computing in Python
brew "ipython"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Helps you navigate your file system faster by learning your habits
brew "jump"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Postgres C API library
brew "libpq", link: true
# Generic machine emulator and virtualizer
brew "qemu"
# Additional guest agents for Lima
brew "lima-additional-guestagents"
# Platform built on V8 to build network applications
brew "node"
# Easily convert Marp Markdown files into static HTML/CSS, PDF, PPT and images
brew "marp-cli"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Command-line Git information tool
brew "onefetch"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Service monitoring system and time series database
brew "prometheus"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Hook preloader
brew "proxychains-ng"
# Pretty, minimal and fast ZSH prompt
brew "pure"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# Generic syntax highlighter
brew "pygments"
# Rsync for cloud storage
brew "rclone"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Autoformat shell script source code
brew "shfmt"
# Work with remote images registries
brew "skopeo"
# SOcket CAT: netcat on steroids
brew "socat"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Traceroute implementation using TCP packets
brew "tcptraceroute"
# User interface to the TELNET protocol
brew "telnet"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# CLI tool to generate terraform files from existing infrastructure
brew "terraformer"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Linter for Terraform files
brew "tflint"
# Programmatically correct mistyped console commands
brew "thefuck"
# Command-line translator using Google Translate and more
brew "translate-shell"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# GNU Binutils for x86_64-linux-gnu cross development
brew "x86_64-linux-gnu-binutils"
# Linter for YAML files
brew "yamllint"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Detect deprecated Kubernetes apiVersions
brew "fairwindsops/tap/pluto"
# Flux CLI
brew "fluxcd/tap/flux"
# Vault
brew "hashicorp/tap/vault"
# Refactoring Terraform code has never been easier
brew "mbode/tap/terraform-state-mover"
# Super fast CLI tool to decode and encode JWTs built in Rust
brew "mike-engel/jwt-cli/jwt-cli"
# A command line editor for HCL
brew "minamijoyo/hcledit/hcledit"
# Application uninstaller
cask "appcleaner"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# E-books management software
cask "calibre"
cask "font-meslo-for-powerline"
cask "inspec"
# Kubernetes IDE
cask "lens"
# Adaptive brightness for external displays
cask "lunar"
# MikroTik Winbox
cask "nrlquaker-winbox"
# Android file transfer
cask "openmtp"
# Command-line shell and scripting language
cask "powershell"
# OpenVPN client
cask "pritunl"
# Quick Look plugin for JSON files
cask "quicklook-json"
# Quicklook extension for source files
cask "syntax-highlight"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Multimedia player
cask "vlc"
# Network protocol analyzer
cask "wireshark-app"
mas "Keynote", id: 409183694
mas "MacDroid", id: 1476545828
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "QuickFTP", id: 1451646819
mas "Telegram", id: 747648890
mas "WireGuard", id: 1451685025
